org/20220509182018-hegemony_is_possible_when_you_re_speaking_to_enduring_human_needs.org
:PROPERTIES:
:ID:       402cb875-4224-465a-a16f-3944fdc2884a
:END:
#+TITLE: Hegemony is possible when you're speaking to enduring human needs
#+CREATED: [2022-05-09 Mon 18:20]
#+LAST_MODIFIED: [2022-05-09 Mon 18:23]


* References

- Christopher Lasch. [[id:cbfef2ef-f24c-402e-93e1-82f03a5c9e54][The Revolt of the Elites and the Betrayal of Democracy]]

  #+begin_quote
It is their capacity to speak to enduring human needs and desires that makes ideologies compelling, even though their view of the world is necessarily blind to their own limitations. To the extent to which ideologies express universal aspirations, their critics have to argue on the same grounds, not just dismiss them as self-serving rationalizations. The need to argue on this common ground---not universal agreement on epistemological foundations---is what creates the possibility of a common culture.
  #+end_quote
