20220509182018-hegemony_is_possible_when_you_re_speaking_to_enduring_human_needs.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-08-31 Wed 19:24 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Hegemony is possible when you're speaking to enduring human needs</title>
<meta name="author" content="Rémi Louf" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="style.css" /></head>
<body>
<div id="content" class="content">
<h1 class="title">Hegemony is possible when you're speaking to enduring human needs</h1>


<div id="outline-container-org145c6d3" class="outline-2">
<h2 id="org145c6d3">References</h2>
<div class="outline-text-2" id="text-org145c6d3">
<ul class="org-ul">
<li><p>
Christopher Lasch. <a href="20220509173950-the_revolt_of_the_elites_and_the_betrayal_of_democracy.html#ID-cbfef2ef-f24c-402e-93e1-82f03a5c9e54">The Revolt of the Elites and the Betrayal of Democracy</a>
</p>

<blockquote>
<p>
It is their capacity to speak to enduring human needs and desires that makes ideologies compelling, even though their view of the world is necessarily blind to their own limitations. To the extent to which ideologies express universal aspirations, their critics have to argue on the same grounds, not just dismiss them as self-serving rationalizations. The need to argue on this common ground&#x2014;not universal agreement on epistemological foundations&#x2014;is what creates the possibility of a common culture.
</p>
</blockquote></li>
</ul>
</div>
</div>

<div id="outline-container-org5e942da" class="outline-2">
<h2 id="org5e942da">Links to this note</h2>
</div>
</div>
</body>
</html>
